app/controllers/groups_controller.rb

INSERT INTO "groups" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 31 Mar 2014 16:10:58 UTC +00:00], ["name", "mpmGroup1"], ["updated_at", Mon, 31 Mar 2014 16:10:58 UTC +00:00]]
---
  def create
    respond_to do |format|
      if @user.groups.create(group_params)

SELECT "groups".* FROM "groups"
---
  def show_all
    @groups = Group.all

SELECT "groups".* FROM "groups" INNER JOIN "relationgroups" ON "groups"."id" = "relationgroups"."group_id" WHERE "relationgroups"."user_id" = ?  [["user_id", 2]]
---
  def index
    @groups = @user.groups

INSERT INTO "relationgroups" ("created_at", "group_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Mon, 31 Mar 2014 16:11:55 UTC +00:00], ["group_id", 1], ["updated_at", Mon, 31 Mar 2014 16:11:55 UTC +00:00], ["user_id", 1]]
---
  def join_group
	  @relation = Relationgroup.new(user_id: params[:user_id], group_id: params[:group_id])
	    begin
		    @relation.save!

SELECT COUNT(*) FROM "relationgroups" WHERE "relationgroups"."group_id" = 1
DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 3]]
SELECT "groups".* FROM "groups" INNER JOIN "relationgroups" ON "groups"."id" = "relationgroups"."group_id" WHERE "relationgroups"."user_id" = ? AND "groups"."id" = ? LIMIT 1  [["user_id", 1], ["id", "3"]]
DELETE FROM "relationgroups" WHERE "relationgroups"."group_id" = ?  [["group_id", 3]]
SELECT "relationgroups".* FROM "relationgroups" WHERE (user_id = '1' and group_id = '1')
---
  def leave_group
	  @relation = Relationgroup.where(group_id: params[:group_id]).count
	    if @relation <= 1
		    @user.groups.find(params[:group_id]).delete
	    else
		    Relationgroup.where(["user_id = :user_id and group_id = :group_id", { user_id: params[:user_id], group_id: params[:group_id] }]).destroy_all