app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "encrypt_password", "name", "salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    @user.name = random_key
    @user.email = @user.name if @user.email == nil

    respond_to do |format|
      if @user.save and @user.create_viewparam(notification_view: '0') and @user.groups.create(name: 'My first group', admin_id: @user.id) and @user.groups.last.groupfolders.create(name: Group.last.name, parent_id: 100) and Group.last.create_calendar(name: 'group calendar') and Group.last.groupchats.create(name: 'general', channel: random_key)

UPDATE "users" SET "encrypt_password" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["encrypt_password", "f8c7b46fef0c012d80a0e4b66cc8750199a013d318aa650ef1f399f33a72334f"], ["updated_at", Thu, 03 Apr 2014 10:51:03 UTC +00:00]]
---
  def update
    @user.update_attributes(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "3"]]
---
  def set_user_origin
    @user = User.find(params[:id])